Repository: progit/progit
Catalog: es/omegat-Benzirpi.tmx
Source language: en
Languages: es

source: You’ve decided that you’re going to work on issue #53 in whatever issue-tracking system your company uses.
es: Decides trabajar el problema #53, del sistema que tu compañia utiliza para llevar seguimiento de los problemas.

source: The output can be sent to the maintainer—it tells them where the work was branched from, summarizes the commits, and tells where to pull this work from.
es: Esta salida puede ser enviada al gestor del proyecto, --le indica el punto donde se ramificó, resume las confirmaciones de cambio, y le dice desde dónde recuperar estos cambios--.

source: You can set each value separately with a series of `git config` commands, or you can add them manually; but in the end, your config file should look something like this:
es: Puedes ir ajustando cada valor individualmente, a través de comandos `git config`; o puedes añadirlos todos manualmente. Pero, al final, tu archivo de configuración ha de quedar más o menos como esto:

source: Generally, if you’re going to these lengths, it’s easier to use SSH public keys; but it may be a better solution in your specific case to use signed SSL certificates or other HTTP-based authentication methods for read-only access over HTTPS.
es: Aunque, si pretendes ir tan lejos, es más sencillo utilizar claves públicas SSH; pero ahí está la posibilidad, por si en algún caso concreto sea mejor solución el uso de certificados SSL u otros medios de autentificación HTTP para el acceso de solo-lectura a través de HTTPS.

source: This command looks up which server origin is (in this case, it’s `git.ourcompany.com`), fetches any data from it that you don’t yet have, and updates your local database, moving your `origin/master` pointer to its new, more up-to-date position (see Figure 3-24).
es: Este comando localiza en qué servidor está el origen (en este caso 'git.ourcompany.com'), recupera cualquier dato presente allí que tu no tengas, y actualiza tu base de datos local, moviendo tu rama 'origin/master' para que apunte a esta nueva y más reciente posición (ver Figura 3-24).

source: ## Stashing ##
es: ## Guardado rápido provisional ##

source: However, if you can’t find a reference in the `refs` directory, it’s probably in your `packed-refs` file.
es: Cualquier referencia que no puedas encontrar en la carpeta `refs`, es muy posible que la encuentres en el archivo `packed-refs`.

source: Because Git is very flexible, people can and do work together many ways, and it’s problematic to describe how you should contribute to a project — every project is a bit different.
es: Por la gran flexibilidad de Git, la gente lo suele utilizar de multiples maneras; siendo problemático intentar describir la forma en que deberías contribuir a un proyecto --cada proyecto tiene sus peculiaridades--.

source: Understanding how Git works at a lower level should make it easier to understand why it’s doing what it’s doing and also to write your own tools and helping scripts to make your specific workflow work for you.
es: Entendiendo cómo trabaja Git a bajo nivel, es más sencillo comprenderestán por qué hace lo que hace. A la par que facilita la escritura de tus propias herramientas y scripts auxiliares para implementar flujos de trabajo tal y como necesites.

source: Change the commit message, and exit the editor.
es: Cambiar el mensaje de la confirmación de cambios y salir del editor.

source: Managing a complex series of parallel contributed topic branches.
es: Gestionando complejas series de ramas puntuales paralelas con funcionalidades varias.

source: If you want to use a graphical tool to resolve these issues, you can run `git mergetool`, which fires up an appropriate visual merge tool and walks you through the conflicts:
es: Si, en lugar de resolver directamente, prefieres utilizar una herramienta gráfica. Puedes usar el comando 'git mergetool'. Esto arrancará la correspondiente herramienta de visualización y te permirá ir resolviendo conflictos con ella.

source: Insert 18333fig0317.png Figure 3-17.
es: Insert 18333fig0317.png Figura 3-17.

source: Let’s say that John and Jessica are working together on one feature, while Jessica and Josie are working on a second.
es: Supongamos que John y Jessica trabajan conjuntamente en una funcionalidad, mientras que jessica y Josie trabajan en una segunda funcionalidad.

source: #### Downloading Data ####
es: #### Descargando datos, (Downloading) ####

source: This section will quickly cover how these two main protocols operate.
es: En esta parte, se verán sucintamente cómo trabajan esos dos tipos de protocolo.

source: Here you’ll configure Git to use the `strings` program to convert Word documents into readable text files, which it will then diff properly:
es: Por ejemplo, puedes configurar Git para que utilice el programa 'strings' para convertir los documentos Word en archivos de texto planos, archivos sobre los que poder realizar comparaciones sin problemas:

source: That starts up an HTTPD server on port 1234 and then automatically starts a web browser that opens on that page.
es: Esto arranca un servidor HTTPD en el puerto 1234, y luego arranca un navegador que abre esa página.

source: That being said, many Git servers authenticate using SSH public keys.
es: Tal y como se ha comentado, muchos servidores Git utilizan la autentificación a través de claves públicas SSH.

source: Staging the files checksums each one (the SHA-1 hash we mentioned in Chapter 1), stores that version of the file in the Git repository (Git refers to them as blobs), and adds that checksum to the staging area:
es: Al preparar los archivos, Git realiza una suma de control de cada uno de ellos (un resumen SHA-1, tal y como se mencionaba en el capítulo 1), almacena una copia de cada uno en el repositorio (estas copias se denominan "blobs"), y guarda cada suma de control en el área de preparación (staging area):

source: If you run `git diff` normally, you only see something like this:
es: Si lanzas un comando 'git diff', lo único que verás será algo tal como:

source: First, add a large object to your history:
es: Para emprezar, añade un objeto enorme a tu historial:

source: One of the interesting features of this is that you can ask it to figure out all sorts of code movement as well.
es: Esto permite preguntar a Git acerca de todo tipo de movimientos en el código.

source: In this case, you can read an existing tree into your staging area as a subtree by using the `--prefix` option to `read-tree`:
es: Y, en este caso, puedes hacerlo como si fuera una subcarpeta utilizando la opción `--prefix`:

source: There are two sets of processes for transferring data: a pair for uploading data and a pair for downloading data.
es: Existen dos conjuntos de procesos para transferir datos: uno para para enviar y otro par para recibir.

source: It doesn’t take any parameters, but you can easily get the last commit by running `git log -1 HEAD`.
es: Este no recibe ningún parámetro, pero podemos obtener facilmente la última confirmación de cambios con el comando 'git log -1 HEAD'.

source: This modifies the files in your working directory.
es: Esto modificará los archivos en tu carpeta de trabajo.

source: You can see that it applied cleanly and automatically created the new commit for you.
es: Observarás que, tras incorporarlo limpiamente, crea automáticamente una nueva confirmación de cambios (commit).

source: Again, this generally does nothing.
es: Y, habitualmente, no hará nada.

source: You can also serve your repositories read-only over HTTPS, which means you can encrypt the content transfer; or you can go so far as to make the clients use specific signed SSL certificates.
es: Puedes también servir tus repositorios de solo lectura a través de HTTPS, teniendo así las transferencias encriptadas. O puedes ir más lejos aún, requiriendo el uso de certificados SSL específicos para cada cliente.

source: Is it centralized, with each developer having equal write access to the main codeline?
es: ¿Es centralizado, con iguales derechos de acceso en escritura para cada desarrollador?.

source: This way, projects don’t have to worry about adding users as collaborators to give them push access.
es: De esta forma, los proyectos no han de preocuparse de añadir usuarios como colaboradores para darles acceso de envio (push).

source: However, first you’ll delete the `hotfix` branch, because you no longer need it — the `master` branch points at the same place.
es: Pero antes, es interesante borrar la rama 'hotfix'. Ya que no la vamos a necesitar más, puesto que apunta exactamente al mismo sitio que la rama 'master'.

source: Running a Git server is simple.
es: Disponer un servidor Git es simple.

source: Now your new project root is what was in the `trunk` subdirectory each time.
es: Tras este comando, la nueva raiz del proyecto pasa a ser el contenido de la carpeta `trunk`.

source: You saw some simple Git configuration details in the first chapter, but I’ll go over them again quickly here.
es: Primeramente, vamos a repasar brevemente los detalles de configuración de Git que ya has visto en el primer capítulo.

source: To start `instaweb` with a non-lighttpd handler, you can run it with the `--httpd` option.
es: Para instalar 'instaweb' disponiendo de un controlador no-lighttpd, puedes lanzarlo con la opción '--httpd'.

source: When you save and close the editor, the editor writes a new commit containing that message and makes it your new last commit.
es: Al guardar y cerrar en el editor, este escribe una nueva confirmación de cambios y reemplaza con ella la última confirmación existente.

source: ### Client-Side Hooks ###
es: ### Puntos de enganche del lado cliente ###

source: Now, you can use the head reference you just created instead of the SHA-1 value in your Git commands:
es: A partir de ese momento, puedes utilizar esa referencia principal que acabas de crear, en lugar del valor SHA-1, en todos tus comandos:

source: What happens if you create a new branch?
es: ¿Qué sucede cuando creas una nueva rama?

source: In this case, it’s `http://github.com/testinguser/iphone_project`.
es: En este ejemplo, la URL es `http://github.com/testinguser/iphone_project`.

source: Now suppose you did that in a branch.
es: Tras esto, y suponiendo que ese paso ha sido realizado en una rama.

source: These instructions are similar to what we’ve already gone over.
es: Estas instrucciones son similares a las que ya hemos visto.

source: This tab also shows a box with the latest commit information.
es: Esta pestaña muestra también un cuadro con información sobre la última confirmación de cambio (commit) realizada en el proyecto.

source: You can use this to make sure a commit message is properly formatted or to normalize the message by having the script edit it in place.
es: Puedes utilizarlo para asegurarte de que el mensaje de confirmación esté correctamente formateado o para normalizar el mensaje permitiendo al script que lo edite sobre la marcha.

source: First, you initialize a new Git repository and verify that there is nothing in the `objects` directory:
es: Para empezar, inicializa un nuevo repositorio Git y comprueba que la carpeta 'objects' está vacia.

source: Don’t judge me — it’s easier to demonstrate in this manner.
es: No me juzgues por ello, --es más sencillo mostrarlo de esta manera--.

source: Figure 3-16 highlights the three snapshots that Git uses to do its merge in this case.
es: La figura 3-16 ilustra las tres instantáneas que Git utiliza para realizar la fusión en este caso.

source: The `git-receive-pack` command immediately responds with one line for each reference it currently has — in this case, just the `master` branch and its SHA.
es: El comando `git-receive-pack` responde con una linea por cada una de las referencias que tenga, --en este caso, la rama `master` y su SHA--.

source: The other two network protocols (HTTP and Git) are generally read-only, so even if you have them available for the unwashed masses, you still need SSH for your own write commands.
es: Los otros dos protocolos de red (HTTP y Git) suelen ser normalmente protocolos de solo-lectura; de tal forma que, aunque los tengas disponibles para el público en general, sigues necesitando SSH para tu propio uso en escritura.

source: That is a very basic case of the transfer protocols.
es: Este es un caso muy sencillo para ilustrar los protocolos de trasferencia.

source: The `Commit` information indicates the person who applied the patch and the time it was applied.
es: El campo 'Commit' muestra la persona que ha incorporado el parche y cuándo lo ha incorporado.

source: Insert 18333fig0405.png Figure 4-5.
es: Insert 18333fig0405.png Figura 4-5.

source: Although you may have legitimate merge issues, you know where in your history their work is based; a proper three-way merge is the default rather than having to supply a `-3` and hope the patch was generated off a public commit to which you have access.
es: A pesar de poder seguir teniendo los habituales problemas con la fusión, por lo menos conoces en qué punto de tu historial han basado su trabajo. Por defecto, se aplicará una genuina fusión a tres bandas, en lugar de tener que poner un '-3' y esperar que el parche haya sido generado a partir de una confirmación de cambios (commit) pública a la que tengas tú también acceso.

source: One of the largest Git projects, the Linux kernel, is beginning to need 12 characters out of the possible 40 to stay unique.
es: Aunque, en uno de los más grandes proyectos gestionados con Git, el kernel de Linux, están siendo necesarios unos 12 caracteres (de los 40 posibles) para garantizar la unicidad.

source: You start a new branch based off the current `origin/master` branch, squash the `featureB` changes there, resolve any conflicts, make the implementation change, and then push that up as a new branch:
es: Para ello, inicias una nueva rama basada en la actual 'origin/master', aplicas (squash) sobre ella los cambios de 'featureB', resuelves los posibles conflictos que se pudieran presentar, realizas los cambios en los detalles, y la envias de vuelta como una nueva rama:

source: Example history for range selection.
es: Ejemplo de historial para selección de rangos.

source: Insert 18333fig0335.png Figure 3-35.
es: Insert 18333fig0335.png Figura 3-35.

source: You can delete it and then manually close the ticket in your ticket-tracking system:
es: Por lo que puedes borrarla. Y cerrar manualmente el problema en el sistema de seguimiento de problemas de tu empresa.

source: Next, you have to tell your Gitosis server which repositories to allow unauthenticated Git server-based access to.
es: A continuación, has de indicar en tu servidor Gitosis a cuales de tus repositorios ha de permitir acceso sin autentificar por parte del servidor Git.

source: This command will apply the other two commits automatically, and then you’re done.
es: Las otras dos confirmaciones de cambio serán reaplicadas automáticamene. Y ya estará completa la reorganización.

source: Insert 18333fig0339.png Figure 3-39.
es: Insert 18333fig0339.png Figura 3-39.

source: The objects that remain are the blobs that aren’t pointed to by any commit — in this case, the "what is up, doc?" example and the "test content" example blobs you created earlier.
es: Solo han quedado aquellos objetos binarios no referenciados por ninguna confirmación de cambios --en este caso, el ejemplo de "¿que hay de nuevo, viejo?" y el ejemplo de "contenido de pruebas"--

source: Insert 18333fig0412.png Figure 4-12.
es: Insert 18333fig0412.png Figura 4-12.

source: If you want to unstage the TODO file at this point, you use the `3` or `r` (for revert) option:
es: Si se desea sacar el archivo TODO del área, se puede utilizar la opción '3' o 'r' (revert):

source: You can delete it with the `-d` option to `git branch`:
es: Esto lo puedes hacer con la opción '-d' del comando 'git branch':

source: You can make a lightweight tag by running something like this:
es: Puedes crear una etiqueta ligera lanzando un comando tal como:

source: It’s like a very small rebase — don’t amend your last commit if you’ve already pushed it.
es: Es como si se realizara una pequeña reorganización (rebase). Y, por tanto, aquí también se aplica la regla de no modificar nunca una confirmación de cambios que ya haya sido enviada (push) a otros.

source: The main difficulty with describing this process is that there are a huge number of variations on how it’s done.
es: El mayor problema al intentar describir este proceso es el gran número de variaciones que se pueden presentar.

source: Although Subversion automatically does such a merge on the server if different files are edited, in Git you must merge the commits locally.
es: Mientras que Subversion fusiona automáticamente en el servidor cuando los cambios han sido aplicados sobre archivos distintos, en Git has de fusionar (merge) los cambios localmente.

source: In this case, Git does a simple three-way merge, using the two snapshots pointed to by the branch tips and the common ancestor of the two.
es: Git realizará una fusión a tres bandas, utilizando las dos instantáneas apuntadas por el extremo de cada una de las ramas y por el ancestro común a ambas dos.

source: The Downloads tab allows you to upload project binaries and link to tarballs and zipped versions of any tagged points in your project.
es: La pestaña "Downloads" permite cargar binarios del proyecto y enlaza con tarballs o versiones comprimidas de cualquier punto marcado (tagged) en tu proyecto.

source: This helps make the data more useful:
es: Esto hace más util la información mostrada:

source: Or if someone tries to edit a file they don’t have access to and push a commit containing it, they will see something similar.
es: O si alguien intenta editar un archivo sobre el que no tiene acceso y luego envia una confirmación de cambios con ello, verá también algo similar.

source: If you run `git diff` on that, you see something interesting:
es: Si se lanza un `git diff` sobre ella, se puede apreciar algo muy interesante:

source: The HTTP method is simple but a bit inefficient.
es: HTTP es un protocolo simple, pero ineficiente.

source: This is also a nice option for quickly grabbing work from someone else’s working repository.
es: Este camino es también util para recuperar rápidamente el contenido del repositorio de trabajo de alguna otra persona.

source: Each level overwrites values in the previous level, so values in `.git/config` trump those in `/etc/gitconfig`, for instance.
es: Cada nivel sobreescribe los valores del nivel anterior; es decir lo configurado en '.git/config' tiene primacia con respecto a lo configurado en '/etc/gitconfig', por ejemplo.

source: At this point, you have 11 objects — 4 blobs, 3 trees, 3 commits, and 1 tag:
es: En este momento, tienes 11 objetos --4 binarios, 3 árboles, 3 confirmaciones de cambios y 1 etiqueta--.

source: If you run a mail client that can save several e-mails out in mbox format, you can save entire patch series into a file and then use git am to apply them one at a time.
es: Si tienes un cliente de correo electrónico capaz de guardar varios mensajes en formato mbox, podrás guardar series completas de parches en un mismo archivo; y luego usar 'git am' para irlos incorporando secuencialmente.

source: The `SHA^@` syntax resolves to all the parents of that commit.
es: La sintaxis 'SHA^@' recupera todos los padres de esa confirmación de cambios (commit).

source: Oops — it looks like that tree object isn’t in loose format on the server, so you get a 404 response back.
es: Pero... ¡Ay!... parece que el objeto árbol no está suelto en el servidor. Por lo que obtienes una respuesta 404 (objeto no encontrado).

source: Here’s an example that hard-resets the master branch in your test repository to an older commit and then recovers the lost commits.
es: Vamos a ver un ejemplo de un retroceso a una confirmación (commit) antigua en la rama principal de tu repositorio de pruebas, y cómo podriamos recuperar las confirmaciones perdidas en este caso.

source: Even if you set up and run your own server internally, you may still want to use a public hosting site for your open source code — it’s generally easier for the open source community to find and help you with.
es: Incluso en el caso de que tengas tu propio servidor interno, puede resultar interesante utilizar también un lugar público; para albergar tu código abierto --normalmente, ahí suele ser más sencillo de localizar por parte de la comunidad--

source: The Git data is served as basic static files (see Chapter 9 for details about exactly how it’s served).
es: Los contenidos Git se sirven como archivos estáticos básicos (ver el Capitulo 9 para más detalles sobre servicios).

source: This is essentially what Git does when you run the `git add` and `git commit` commands — it stores blobs for the files that have changed, updates the index, writes out trees, and writes commit objects that reference the top-level trees and the commits that came immediately before them.
es: Esto es básicamente lo que hace Git cada vez que utilizas los comandos `git add` y `git commit`: guardar objetos binarios (blobs) para los archivos modificados, actualizar el índice, escribir árboles (trees), escribir objetos de confirmación de cambios (commits) que los referencian y relacionar cada uno de ellos con su inmediato precedente.

source: How often do you contribute?
es: ¿Con qué frecuencia?.

source: A number of developers are nodes — consumers of that hub — and synchronize to that one place (see Figure 5-1).
es: Unos cuantos desarrolladores son nodos de trabajo --consumidores de dicho repositorio-- y se sincronizan con dicho punto central. (ver Figura 5-1).

source: You can daemonize this process a number of ways, depending on the operating system you’re running.
es: Este proceso se puede demonizar de diferentes maneras, dependiendo del sistema operativo con el que trabajas.

source: By default, Git uses whatever you’ve set as your default text editor or else falls back to the Vi editor to create and edit your commit and tag messages.
es: Por defecto, Git utiliza cualquier editor que hayas configurado como editor de texto por defecto de tu sistema. O, si no lo has configurado, utilizará Vi como editor para crear y editar las etiquetas y mensajes de tus confirmaciones de cambio (commit).

source: You also need to make sure these tools are executable:
es: Además has de asegurarte de que estas herramientas son ejecutables:

source: When that value is set, Git colors its output if the output goes to a terminal.
es: Ajustando así este parámetro, Git colorea sus resultados cuando estos se muestran en un terminal.

source: You can rebase the server branch onto the master branch without having to check it out first by running `git rebase [basebranch] [topicbranch]` — which checks out the topic branch (in this case, `server`) for you and replays it onto the base branch (`master`):
es: Puedes reorganizar (rebase) la rama 'server' sobre la rama 'master' sin necesidad siquiera de comprobarlo previamente, usando el comando 'git rebase [ramabase] [ramapuntual]'. El cual activa la rama puntual ('server' en este caso) y la aplica sobre la rama base ('master' en este caso):

source: Lieutenants merge the developers’ topic branches into their master branch.
es: Los tenienentes fusionan (merge) las ramas puntuales de los desarrolladores sobre su propia rama master.

source: You can also set up a graphical merge conflict–resolution tool instead of having to resolve conflicts manually.
es: Puedes incluso configurar una herramienta gráfica para la resolución de conflictos, en lugar de resolverlos manualmente.
